hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
#include "qca7000.hpp"
#include <port/port_common.hpp>
#include <esp32s3/port_config.hpp>
#include <slac/config.hpp>
#ifdef ESP_LOGW
#pragma push_macro("ESP_LOGW")
#undef ESP_LOGW
#define RESTORE_ESP_LOGW
#endif
#include <port/logging_compat.hpp>
#ifdef RESTORE_ESP_LOGW
#pragma pop_macro("ESP_LOGW")
#undef RESTORE_ESP_LOGW
#endif
#include <slac/endian.hpp>
#include <stdint.h>
#include <inttypes.h>
#ifdef ESP_PLATFORM
#include <esp_random.h>
#include <esp_idf_version.h>
#include <esp_err.h>
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#else
static inline uint32_t esp_random() {
    return 0x12345678u;
}
using gpio_num_t = int;
static inline void gpio_set_level(gpio_num_t, int) {}
static inline void gpio_set_direction(gpio_num_t, int) {}
#define GPIO_MODE_OUTPUT 0
#endif
#ifndef IRAM_ATTR
#define IRAM_ATTR
#endif
#ifdef ESP_PLATFORM
#ifndef PLC_INT_EDGE
#define PLC_INT_EDGE GPIO_INTR_NEGEDGE
#endif
#endif
#include <atomic>
#include <slac/fsm.hpp>
#include <slac/iso15118_consts.hpp>
#include <slac/slac.hpp>
#include <slac/slac_states.hpp>
#include <slac/match_log.hpp>
#include <cstdio>
#include <string.h>
#include <new>

#ifdef htole16
#undef htole16
#endif
#ifdef le16toh
#undef le16toh
#endif
#ifdef htole32
#undef htole32
#endif
#ifdef le32toh
#undef le32toh
#endif

const char* PLC_TAG = "PLC_IF";

uint8_t myethtransmitbuffer[V2GTP_BUFFER_SIZE]{};
size_t myethtransmitlen = 0;
uint8_t myethreceivebuffer[V2GTP_BUFFER_SIZE]{};
size_t myethreceivelen = 0;

// Forward declarations
static esp_err_t txFrame(const uint8_t* eth, size_t ethLen);
void qca7000ProcessSlice(uint32_t max_us);

static constexpr uint16_t SIG = 0xAA55;
static constexpr uint16_t WRBUF_RST = 0x0C5B;
static constexpr uint16_t SOF_WORD = 0xAAAA;
static constexpr uint16_t EOF_WORD = 0x5555;
static constexpr uint16_t TX_HDR = 8;
static constexpr uint16_t RX_HDR = 12;
static constexpr uint16_t FTR_LEN = 2;
static constexpr uint16_t INTR_MASK = SPI_INT_CPU_ON | SPI_INT_PKT_AVLBL | SPI_INT_RDBUF_ERR | SPI_INT_WRBUF_ERR;

using FSMBuffer = slac::fsm::buffer::SwapBuffer<64, 0, 1>;
using FSM = slac::fsm::FSM<slac::SlacEvent, int, FSMBuffer>;
struct SoundingState;

struct SlacContext {
    uint8_t run_id[slac::defs::RUN_ID_LEN]{};
    uint32_t timer{0};
    uint8_t sound_sent{0};
    SlacState result{SlacState::Idle};
    uint8_t validate_count{0};
    slac::messages::cm_slac_match_req match_req{};
    uint8_t match_src_mac[ETH_ALEN]{};
    uint8_t pev_id[slac::messages::PEV_ID_LEN]{};
    uint8_t evse_id[slac::messages::EVSE_ID_LEN]{};
    uint8_t atten_sum[slac::defs::AAG_LIST_LEN]{};
    uint8_t atten_count{0};
    uint8_t num_groups{0};
    uint8_t pev_mac[ETH_ALEN]{};
    uint8_t retry_count{0};
    uint8_t matched_mac[ETH_ALEN]{};
    bool filter_active{false};
    bool validate_success{false};
};

static FSMBuffer g_fsm_buf{};
static SlacContext g_slac_ctx{};
static FSM g_fsm(g_fsm_buf);

static void clear_slac_state() {
    memset(g_slac_ctx.run_id, 0, sizeof(g_slac_ctx.run_id));
    memset(&g_slac_ctx.match_req, 0, sizeof(g_slac_ctx.match_req));
    memset(g_slac_ctx.match_src_mac, 0, ETH_ALEN);
    memset(g_slac_ctx.pev_mac, 0, ETH_ALEN);
    memset(g_slac_ctx.matched_mac, 0, ETH_ALEN);
    memset(g_slac_ctx.atten_sum, 0, sizeof(g_slac_ctx.atten_sum));
    g_slac_ctx.atten_count = 0;
    g_slac_ctx.num_groups = 0;
    g_slac_ctx.sound_sent = 0;
    g_slac_ctx.validate_count = 0;
    g_slac_ctx.retry_count = 0;
    g_slac_ctx.filter_active = false;
    g_slac_ctx.validate_success = false;
    g_slac_ctx.timer = 0;
}

struct ErrorCallbackCtx {
    qca7000_error_cb_t cb{nullptr};
    void* arg{nullptr};
    bool* flag{nullptr};
};
static ErrorCallbackCtx g_err_cb;
static uint8_t g_buferr_count = 0;
static uint32_t g_buferr_ts = 0;
static bool g_driver_fatal = false;
static uint8_t g_crash_count = 0;

__attribute__((weak)) void qca7000ToggleCpEf() {}
__attribute__((weak)) bool qca7000CheckBcbToggle() { return false; }

typedef void (*qca7000_link_ready_cb_t)(bool ready, void* arg);
static qca7000_link_ready_cb_t g_link_ready_cb = nullptr;
static void* g_link_ready_arg = nullptr;

struct SavedParams {
    uint8_t nmk[slac::defs::NMK_LEN]{};
    uint8_t mac[ETH_ALEN]{};
    uint8_t pev_id[slac::messages::PEV_ID_LEN]{};
    uint8_t evse_id[slac::messages::EVSE_ID_LEN]{};
};
static SavedParams g_saved_params{};
static bool g_sleeping = false;

void qca7000SetErrorCallback(qca7000_error_cb_t cb, void* arg, bool* flag) {
    g_err_cb.cb = cb;
    g_err_cb.arg = arg;
    g_err_cb.flag = flag;
    g_driver_fatal = false;
}

bool qca7000DriverFatal() {
    return g_driver_fatal;
}

void qca7000SetIds(const uint8_t pev_id[slac::messages::PEV_ID_LEN],
                   const uint8_t evse_id[slac::messages::EVSE_ID_LEN]) {
    if (pev_id)
        memcpy(g_slac_ctx.pev_id, pev_id, sizeof(g_slac_ctx.pev_id));
    if (evse_id)
        memcpy(g_slac_ctx.evse_id, evse_id, sizeof(g_slac_ctx.evse_id));
}

static uint8_t g_evse_nmk[slac::defs::NMK_LEN]{};
static uint8_t g_evse_nid[slac::defs::NID_LEN]{};
static qca7000_region g_region = qca7000_region::EU;

static bool send_cm_set_key_req_local(const uint8_t nmk[slac::defs::NMK_LEN],
                                      const uint8_t nid[slac::defs::NID_LEN]);

void qca7000SetNmk(const uint8_t nmk[slac::defs::NMK_LEN]) {
    if (nmk) {
        memcpy(g_evse_nmk, nmk, sizeof(g_evse_nmk));
        slac::utils::generate_nid_from_nmk(
            g_evse_nid, g_evse_nmk,
            slac::defs::NID_SECURITY_LEVEL_SIMPLE_CONNECT);
    } else {
        memset(g_evse_nmk, 0, sizeof(g_evse_nmk));
        memset(g_evse_nid, 0, sizeof(g_evse_nid));
    }

    send_cm_set_key_req_local(g_evse_nmk, g_evse_nid);
}

const uint8_t* qca7000GetNmk() {
    return g_evse_nmk;
}

#ifdef LIBSLAC_TESTING
spi_device_handle_t g_spi = nullptr;
int g_cs = -1;
int g_rst = PLC_SPI_RST_PIN;
int g_int = PLC_INT_PIN;
int g_pwr = PLC_PWR_EN_PIN;
#else
static spi_device_handle_t g_spi = nullptr;
static int g_cs = -1;
static int g_rst = PLC_SPI_RST_PIN;
static int g_int = PLC_INT_PIN;
static int g_pwr = PLC_PWR_EN_PIN;
#endif
static bool g_auto_irq = true;

#ifdef ESP_PLATFORM
static void IRAM_ATTR qca7000_isr(void*) {
    qca7000ProcessSlice(500);
}
#endif

#ifdef ESP_PLATFORM
static SemaphoreHandle_t g_spi_mutex = nullptr;
static inline void spiBegin() {
    if (!g_spi_mutex)
        g_spi_mutex = xSemaphoreCreateMutex();
    xSemaphoreTake(g_spi_mutex, portMAX_DELAY);
    spi_device_acquire_bus(g_spi, portMAX_DELAY);
}
static inline void spiEnd() {
    spi_device_release_bus(g_spi);
    if (g_spi_mutex)
        xSemaphoreGive(g_spi_mutex);
}
static inline esp_err_t spiTransfer16(uint16_t data, uint16_t* out, int hz) {
    spi_transaction_t t{};
    t.flags = SPI_TRANS_USE_TXDATA | SPI_TRANS_USE_RXDATA;
    t.length = 16;
    t.tx_data[0] = data >> 8;
    t.tx_data[1] = data & 0xFF;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
    t.override_freq_hz = hz;
#elif ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0) || defined(LIBSLAC_TESTING)
    t.clock_speed_hz = hz;
#else
    (void)hz;
#endif
    esp_err_t err = spi_device_polling_transmit(g_spi, &t);
    if (err != ESP_OK) {
        ESP_LOGE(PLC_TAG, "spiTransfer16 failed: %s", esp_err_to_name(err));
        return err;
    }
    if (out)
        *out = (static_cast<uint16_t>(t.rx_data[0]) << 8) | t.rx_data[1];
    return ESP_OK;
}
static inline esp_err_t spiTransfer(uint8_t data, uint8_t* out, int hz) {
    spi_transaction_t t{};
    t.flags = SPI_TRANS_USE_TXDATA | SPI_TRANS_USE_RXDATA;
    t.length = 8;
    t.tx_data[0] = data;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
    t.override_freq_hz = hz;
#elif ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0) || defined(LIBSLAC_TESTING)
    t.clock_speed_hz = hz;
#else
    (void)hz;
#endif
    esp_err_t err = spi_device_polling_transmit(g_spi, &t);
    if (err != ESP_OK) {
        ESP_LOGE(PLC_TAG, "spiTransfer failed: %s", esp_err_to_name(err));
        return err;
    }
    if (out)
        *out = t.rx_data[0];
    return ESP_OK;
}
static inline esp_err_t spiWriteBytes(const uint8_t* d, size_t l, int hz) {
    if (!l) return ESP_OK;
    spi_transaction_t t{};
    t.length = l * 8;
    t.tx_buffer = d;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
    t.override_freq_hz = hz;
#elif ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0) || defined(LIBSLAC_TESTING)
    t.clock_speed_hz = hz;
#else
    (void)hz;
#endif
    esp_err_t err = spi_device_polling_transmit(g_spi, &t);
    if (err != ESP_OK)
        ESP_LOGE(PLC_TAG, "spiWriteBytes failed: %s", esp_err_to_name(err));
    return err;
}
#else
static inline void spiBegin() {}
static inline void spiEnd() {}
static inline esp_err_t spiTransfer16(uint16_t, uint16_t*, int) { return ESP_OK; }
static inline esp_err_t spiTransfer(uint8_t, uint8_t*, int) { return ESP_OK; }
static inline esp_err_t spiWriteBytes(const uint8_t*, size_t, int) { return ESP_OK; }
#endif

namespace {
struct RxEntry {
    size_t len;
    uint8_t data[V2GTP_BUFFER_SIZE];
};
static_assert(CONFIG_RX_RING_SIZE &&
                  ((CONFIG_RX_RING_SIZE & (CONFIG_RX_RING_SIZE - 1)) == 0),
              "CONFIG_RX_RING_SIZE must be a power of two");
static constexpr uint8_t RING_SIZE = CONFIG_RX_RING_SIZE;
static constexpr uint8_t RING_MASK = RING_SIZE - 1;
static RxEntry ring[RING_SIZE];
static std::atomic<uint8_t> head{0}, tail{0};
static std::atomic<uint32_t> g_rx_overflow_count{0};

inline bool ringEmpty() {
    return head.load(std::memory_order_acquire) == tail.load(std::memory_order_acquire);
}

inline void ringPush(const uint8_t* d, size_t l) {
    if (l > V2GTP_BUFFER_SIZE)
        l = V2GTP_BUFFER_SIZE;
    auto h = head.load(std::memory_order_acquire);
    auto t = tail.load(std::memory_order_acquire);
    uint8_t next = (h + 1) & RING_MASK;
    if (next == t) {
        ESP_LOGW(PLC_TAG, "RX ring full - dropping frame");
        g_rx_overflow_count.fetch_add(1, std::memory_order_relaxed);
        return;
    }
    memcpy(ring[h].data, d, l);
    ring[h].len = l;
    head.store(next, std::memory_order_release);
}

inline bool ringPop(const uint8_t** d, size_t* l) {
    auto t = tail.load(std::memory_order_acquire);
    if (head.load(std::memory_order_acquire) == t)
        return false;
    *d = ring[t].data;
    *l = ring[t].len;
    tail.store((t + 1) & RING_MASK, std::memory_order_release);
    return true;
}

uint32_t qca7000GetRxOverflowCount() {
    return g_rx_overflow_count.load(std::memory_order_relaxed);
}
#ifdef LIBSLAC_TESTING
extern "C" void mock_ring_reset() {
    head.store(0);
    tail.store(0);
    g_rx_overflow_count.store(0, std::memory_order_relaxed);
}
extern "C" void mock_receive_frame(const uint8_t* f, size_t l) { ringPush(f, l); }
#endif
} // namespace

static inline uint16_t cmd16(bool rd, bool intr, uint16_t reg) {
    return (rd ? 0x8000u : 0) | (intr ? 0x4000u : 0) | (reg & 0x3FFFu);
}

static esp_err_t spiRd16_slow(uint16_t reg, uint16_t* out) {
    spiBegin();
    int hz = slac::spi_slow_hz();
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
    uint16_t tmp;
    esp_err_t err = spiTransfer16(cmd16(true, true, reg), &tmp, hz);
    if (err == ESP_OK)
        err = spiTransfer16(0, out, hz);
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
    spiEnd();
    return err;
}

static esp_err_t spiWr16_slow(uint16_t reg, uint16_t val) {
    spiBegin();
    int hz = slac::spi_slow_hz();
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
    uint16_t tmp;
    esp_err_t err = spiTransfer16(cmd16(false, true, reg), &tmp, hz);
    if (err == ESP_OK)
        err = spiTransfer16(val, &tmp, hz);
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
    spiEnd();
    return err;
}

