hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
#ifdef LIBSLAC_TESTING
esp_err_t txFrame(const uint8_t* eth, size_t ethLen) {
#else
static esp_err_t txFrame(const uint8_t* eth, size_t ethLen) {
#endif
    if (ethLen > 1522)
        return ESP_ERR_INVALID_ARG;
    size_t frameLen = ethLen;
    if (frameLen < 60)
        frameLen = 60;
    uint16_t spiLen = TX_HDR + frameLen + FTR_LEN;
    uint16_t avail = 0;
    esp_err_t err = spiRd16_slow(SPI_REG_WRBUF_SPC_AVA, &avail);
    if (err != ESP_OK)
        return err;
    if (avail < spiLen)
        return ESP_FAIL;

    spiWr16_slow(SPI_REG_BFR_SIZE, spiLen);

    spiBegin();
    int hz = slac::spi_fast_hz();
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
    uint16_t tmp16;
    err = spiTransfer16(cmd16(false, false, 0), &tmp16, hz);
    if (err == ESP_OK)
        err = spiTransfer16(SOF_WORD, &tmp16, hz);
    if (err == ESP_OK)
        err = spiTransfer16(SOF_WORD, &tmp16, hz);
    if (err == ESP_OK)
        err = spiTransfer16(slac::htole16(static_cast<uint16_t>(frameLen)), &tmp16, hz);
    if (err == ESP_OK)
        err = spiTransfer16(0, &tmp16, hz);
    if (err == ESP_OK && ethLen) {
        size_t off = 0;
        while (off < ethLen && err == ESP_OK) {
            size_t chunk = ethLen - off;
            if (chunk > slac::spi_burst_len())
                chunk = slac::spi_burst_len();
            err = spiWriteBytes(eth + off, chunk, hz);
            off += chunk;
        }
    }
    if (err == ESP_OK && frameLen > ethLen) {
        uint8_t pad[60]{};
        size_t padLen = frameLen - ethLen;
        size_t off = 0;
        while (off < padLen && err == ESP_OK) {
            size_t chunk = padLen - off;
            if (chunk > slac::spi_burst_len())
                chunk = slac::spi_burst_len();
            err = spiWriteBytes(pad, chunk, hz);
            off += chunk;
        }
    }
    if (err == ESP_OK)
        err = spiTransfer16(EOF_WORD, &tmp16, hz);
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
    spiEnd();
    return err;
}

static void handleRxError(const char* reason) {
    ESP_LOGW(PLC_TAG, "RX error: %s - resetting", reason);
    spiWr16_slow(SPI_REG_INTR_ENABLE, 0);
    bool ok = qca7000SoftReset();
    uint16_t cfg = 0;
    spiRd16_slow(SPI_REG_SPI_CONFIG, &cfg);
    if (cfg & QCASPI_MULTI_CS_BIT) {
        ESP_LOGW(PLC_TAG, "Clearing MULTI_CS bit after reset");
        spiWr16_slow(SPI_REG_SPI_CONFIG, cfg & ~QCASPI_MULTI_CS_BIT);
    }
    if (!ok) {
        ESP_LOGW(PLC_TAG, "Soft reset failed - performing hard reset");
        ok = hardReset();
    }
    if (!ok) {
        ESP_LOGE(PLC_TAG, "Hard reset failed");
        g_driver_fatal = true;
        if (g_err_cb.flag)
            *g_err_cb.flag = true;
        if (g_err_cb.cb)
            g_err_cb.cb(Qca7000ErrorStatus::DriverFatal, g_err_cb.arg);
        return;
    }
    head.store(0, std::memory_order_relaxed);
    tail.store(0, std::memory_order_relaxed);
    spiWr16_slow(SPI_REG_INTR_ENABLE, INTR_MASK);
    if (g_err_cb.cb)
        g_err_cb.cb(Qca7000ErrorStatus::Reset, g_err_cb.arg);
}
#ifdef LIBSLAC_TESTING
esp_err_t fetchRx() {
#else
static esp_err_t fetchRx() {
#endif
    while (true) {
        uint16_t avail = 0;
        esp_err_t err = spiRd16_slow(SPI_REG_RDBUF_BYTE_AVA, &avail);
        if (err != ESP_OK)
            return err;
        if (avail < RX_HDR + FTR_LEN || avail > V2GTP_BUFFER_SIZE)
            break;

        uint16_t requested = avail;
        spiWr16_slow(SPI_REG_BFR_SIZE, requested);

        static uint8_t buf[V2GTP_BUFFER_SIZE];
        spiBegin();
        int hz = slac::spi_fast_hz();
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
        uint16_t first = 0;
        err = spiTransfer16(cmd16(true, false, 0), &first, hz);
        if (err == ESP_OK) {
            buf[0] = first & 0xFF;
            buf[1] = first >> 8;
            for (uint16_t i = 0; i < requested - 2 && err == ESP_OK; ++i) {
                uint8_t b;
                err = spiTransfer(0, &b, hz);
                buf[i + 2] = b;
            }
        }
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
        spiEnd();
        if (err != ESP_OK)
            return err;

        const uint8_t* p = buf;
        uint16_t remaining = requested;
        while (remaining >= RX_HDR + FTR_LEN) {
            uint32_t len = (uint32_t)p[0] | ((uint32_t)p[1] << 8) |
                            ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
            if (memcmp(p + 4, "\xAA\xAA\xAA\xAA", 4) != 0) {
                handleRxError("bad SOF");
                remaining = 0;
                break;
            }

            uint16_t fl = slac::le16toh(static_cast<uint16_t>((p[9] << 8) | p[8]));
            uint16_t frame_total = RX_HDR + fl + FTR_LEN;
            if (len != frame_total && len + 4 != frame_total) {
                ESP_LOGE(PLC_TAG,
                         "RX len mismatch: req=%" PRIu32 " got=%" PRIu32,
                         static_cast<uint32_t>(frame_total), len);
                handleRxError("length mismatch");
                remaining = 0;
                break;
            }

            if (frame_total > remaining) {
                handleRxError("invalid FL");
                remaining = 0;
                break;
            }
            if (p[RX_HDR + fl] != 0x55 || p[RX_HDR + fl + 1] != 0x55) {
                handleRxError("bad EOF");
                remaining = 0;
                break;
            }

            ringPush(p + RX_HDR, fl);

            p += frame_total;
            remaining -= frame_total;
        }
    }
    return ESP_OK;
}

bool spiQCA7000SendEthFrame(const uint8_t* f, size_t l) {
    esp_err_t err = txFrame(f, l);
    if (err == ESP_OK && l <= V2GTP_BUFFER_SIZE) {
        memcpy(myethtransmitbuffer, f, l);
        myethtransmitlen = l;
    }
    return err == ESP_OK;
}
size_t spiQCA7000checkForReceivedData(uint8_t* d, size_t m) {
    if (fetchRx() != ESP_OK)
        return 0;
    const uint8_t* s;
    size_t l;
    if (!ringPop(&s, &l))
        return 0;
    size_t c = l > m ? m : l;
    memcpy(d, s, c);
    size_t store = l;
    if (l > V2GTP_BUFFER_SIZE) {
        ESP_LOGW(PLC_TAG, "RX frame larger than buffer (%zu > %d) - truncating", l, V2GTP_BUFFER_SIZE);
        store = V2GTP_BUFFER_SIZE;
    }
    memcpy(myethreceivebuffer, s, store);
    myethreceivelen = store;
    return c;
}

static uint8_t g_src_mac[ETH_ALEN] = {0x02, 0x00, 0x00, 0x00, 0x00, 0x01};

