hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
static bool send_atten_char_rsp(const SlacContext& ctx, const uint8_t* dst,
                                const slac::messages::cm_atten_char_ind* ind) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::cm_atten_char_rsp rsp;
    } msg{};

    memset(&msg, 0, sizeof(msg));
    memcpy(msg.eth.ether_dhost, dst, ETH_ALEN);
    memcpy(msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    msg.hp.mmtype = slac::htole16(slac::defs::MMTYPE_CM_ATTEN_CHAR | slac::defs::MMTYPE_MODE_RSP);
    msg.rsp.application_type = slac::defs::COMMON_APPLICATION_TYPE;
    msg.rsp.security_type = slac::defs::COMMON_SECURITY_TYPE;
    memcpy(msg.rsp.source_address, qca7000GetMac(), ETH_ALEN);
    memcpy(msg.rsp.run_id, ind->run_id, sizeof(ind->run_id));
    memcpy(msg.rsp.source_id, ind->source_id, sizeof(ind->source_id));
    memcpy(msg.rsp.resp_id, ind->resp_id, sizeof(ind->resp_id));
    msg.rsp.result = slac::defs::CM_ATTEN_CHAR_RSP_RESULT;
    return txFrame(reinterpret_cast<uint8_t*>(&msg), sizeof(msg)) == ESP_OK;
}

static bool send_atten_char_ind(const SlacContext& ctx) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::cm_atten_char_ind ind;
    } msg{};

    memset(&msg, 0, sizeof(msg));
    memcpy(msg.eth.ether_dhost, ctx.pev_mac, ETH_ALEN);
    memcpy(msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    msg.hp.mmtype =
        slac::htole16(slac::defs::MMTYPE_CM_ATTEN_CHAR | slac::defs::MMTYPE_MODE_IND);
    msg.ind.application_type = slac::defs::COMMON_APPLICATION_TYPE;
    msg.ind.security_type = slac::defs::COMMON_SECURITY_TYPE;
    memcpy(msg.ind.source_address, ctx.pev_mac, ETH_ALEN);
    memcpy(msg.ind.run_id, ctx.run_id, sizeof(ctx.run_id));
    memcpy(msg.ind.source_id, ctx.pev_id, sizeof(ctx.pev_id));
    memcpy(msg.ind.resp_id, ctx.evse_id, sizeof(ctx.evse_id));
    msg.ind.num_sounds = slac::defs::C_EV_MATCH_MNBC;
    msg.ind.attenuation_profile.num_groups = ctx.num_groups;
    for (uint8_t i = 0; i < ctx.num_groups && i < slac::defs::AAG_LIST_LEN; ++i) {
        msg.ind.attenuation_profile.aag[i] =
            ctx.atten_sum[i] / slac::defs::C_EV_MATCH_MNBC;
    }
    return txFrame(reinterpret_cast<uint8_t*>(&msg), sizeof(msg)) == ESP_OK;
}

static bool send_set_key_cnf(const SlacContext& ctx, const uint8_t* dst, const slac::messages::cm_set_key_req* req) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::cm_set_key_cnf cnf;
    } msg{};

    memset(&msg, 0, sizeof(msg));
    memcpy(msg.eth.ether_dhost, dst, ETH_ALEN);
    memcpy(msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    msg.hp.mmtype = slac::htole16(slac::defs::MMTYPE_CM_SET_KEY | slac::defs::MMTYPE_MODE_CNF);
    msg.cnf.result = slac::defs::CM_SET_KEY_CNF_RESULT_SUCCESS;
    msg.cnf.my_nonce = req->my_nonce;
    msg.cnf.your_nonce = req->your_nonce;
    msg.cnf.pid = req->pid;
    msg.cnf.prn = req->prn;
    msg.cnf.pmn = req->pmn;
    msg.cnf.cco_capability = req->cco_capability;
    return txFrame(reinterpret_cast<uint8_t*>(&msg), sizeof(msg)) == ESP_OK;
}

static bool send_validate_cnf(const uint8_t* dst, const slac::messages::cm_validate_req* req) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::cm_validate_cnf cnf;
    } msg{};

    memset(&msg, 0, sizeof(msg));
    memcpy(msg.eth.ether_dhost, dst, ETH_ALEN);
    memcpy(msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    msg.hp.mmtype = slac::htole16(slac::defs::MMTYPE_CM_VALIDATE | slac::defs::MMTYPE_MODE_CNF);
    msg.cnf.signal_type = req->signal_type;
    msg.cnf.toggle_num = 0;
    msg.cnf.result = req->result;

    if (g_slac_ctx.validate_count == 1) {
        if (slac::validation_disabled()) {
            msg.cnf.result = 0x04;
            g_slac_ctx.validate_success = true;
        } else {
            bool ok = qca7000CheckBcbToggle();
            msg.cnf.toggle_num = ok ? 1 : 0;
            msg.cnf.result = ok ? 0x02 : 0x03;
            g_slac_ctx.validate_success = ok;
        }
    }

    return txFrame(reinterpret_cast<uint8_t*>(&msg), sizeof(msg)) == ESP_OK;
}

static bool send_match_cnf(const SlacContext& ctx) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::cm_slac_match_cnf cnf;
    } msg{};

    // Generate a fresh NMK and corresponding NID for this session
#ifdef ESP_PLATFORM
    esp_fill_random(g_evse_nmk, sizeof(g_evse_nmk));
#else
    for (auto& b : g_evse_nmk)
        b = static_cast<uint8_t>(esp_random() & 0xFF);
#endif
    slac::utils::generate_nid_from_nmk(
        g_evse_nid, g_evse_nmk,
        slac::defs::NID_SECURITY_LEVEL_SIMPLE_CONNECT);

    memset(&msg, 0, sizeof(msg));
    memcpy(msg.eth.ether_dhost, ctx.match_src_mac, ETH_ALEN);
    memcpy(msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    msg.hp.mmtype = slac::htole16(slac::defs::MMTYPE_CM_SLAC_MATCH | slac::defs::MMTYPE_MODE_CNF);
    msg.cnf.application_type = ctx.match_req.application_type;
    msg.cnf.security_type = ctx.match_req.security_type;
    msg.cnf.mvf_length = slac::htole16(slac::defs::CM_SLAC_MATCH_CNF_MVF_LENGTH);
    memcpy(msg.cnf.pev_id, ctx.match_req.pev_id, sizeof(msg.cnf.pev_id));
    memcpy(msg.cnf.pev_mac, ctx.match_req.pev_mac, sizeof(msg.cnf.pev_mac));
    memcpy(msg.cnf.evse_id, ctx.match_req.evse_id, sizeof(msg.cnf.evse_id));
    memcpy(msg.cnf.evse_mac, ctx.match_req.evse_mac, sizeof(msg.cnf.evse_mac));
    memcpy(msg.cnf.run_id, ctx.match_req.run_id, sizeof(msg.cnf.run_id));
    memcpy(msg.cnf.nid, g_evse_nid, sizeof(msg.cnf.nid));
    memcpy(msg.cnf.nmk, g_evse_nmk, sizeof(msg.cnf.nmk));

    esp_err_t err = txFrame(reinterpret_cast<uint8_t*>(&msg), sizeof(msg));
    bool ok = (err == ESP_OK);
    if (ok)
        qca7000SetNmk(g_evse_nmk);

    slac::MatchLogInfo info{};
    memcpy(info.pev_mac, ctx.match_req.pev_mac, ETH_ALEN);
    memcpy(info.evse_mac, ctx.match_req.evse_mac, ETH_ALEN);
    memcpy(info.nmk, g_evse_nmk, sizeof(info.nmk));

    uint8_t min = 0xFF, max = 0, sum = 0;
    for (uint8_t i = 0; i < ctx.num_groups && i < slac::defs::AAG_LIST_LEN; ++i) {
        uint8_t v = ctx.atten_sum[i] / slac::defs::C_EV_MATCH_MNBC;
        if (v < min)
            min = v;
        if (v > max)
            max = v;
        sum += v;
    }
    info.tone_min = (ctx.num_groups ? min : 0);
    info.tone_max = (ctx.num_groups ? max : 0);
    info.tone_avg = (ctx.num_groups ? (sum / ctx.num_groups) : 0);
    info.cp_state = slac::slac_get_cp_state();

    slac::slac_log_match(info);

  return ok;
}

// Handle SLAC messages polled by the application
void qca7000HandleSlacParmReq(slac::messages::HomeplugMessage& msg) {
    const auto& req = msg.get_payload<slac::messages::cm_slac_parm_req>();
    uint8_t expected_app =
        (g_region == qca7000_region::NA) ? 0x01 : slac::defs::COMMON_APPLICATION_TYPE;
    if (req.application_type != expected_app ||
        req.security_type != slac::defs::COMMON_SECURITY_TYPE) {
        ESP_LOGW(PLC_TAG, "Invalid CM_SLAC_PARM.REQ app/security %u/%u",
                 req.application_type, req.security_type);
        return;
    }
    bool duplicate =
        memcmp(req.run_id, g_slac_ctx.run_id, sizeof(g_slac_ctx.run_id)) == 0;
    memcpy(g_slac_ctx.run_id, req.run_id, sizeof(g_slac_ctx.run_id));
    memcpy(g_slac_ctx.pev_mac, msg.get_src_mac(), ETH_ALEN);
    g_slac_ctx.timer = slac_millis();
    g_slac_ctx.retry_count = slac::defs::C_EV_MATCH_RETRY;
    g_slac_ctx.sound_sent = 0;
    g_slac_ctx.validate_count = 0;
    g_slac_ctx.atten_count = 0;
    memset(g_slac_ctx.atten_sum, 0, sizeof(g_slac_ctx.atten_sum));
    g_slac_ctx.num_groups = 0;
    memset(&g_slac_ctx.match_req, 0, sizeof(g_slac_ctx.match_req));
    memset(g_slac_ctx.match_src_mac, 0, ETH_ALEN);
    memset(g_slac_ctx.matched_mac, 0, ETH_ALEN);
    g_slac_ctx.filter_active = false;
    g_slac_ctx.validate_success = false;

    if (duplicate)
        ESP_LOGI(PLC_TAG, "Restarting SLAC after duplicate CM_SLAC_PARM.REQ");

    send_parm_cnf(g_slac_ctx, msg.get_src_mac(), req);
    send_start_atten_char(g_slac_ctx);
    g_slac_ctx.timer = slac_millis();
    g_fsm.reset<SoundingState>(g_slac_ctx);
}

