hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
void qca7000SetLinkReadyCallback(qca7000_link_ready_cb_t cb, void* arg) {
    g_link_ready_cb = cb;
    g_link_ready_arg = arg;
}

bool qca7000Sleep() {
    if (g_sleeping)
        return true;
    memcpy(g_saved_params.nmk, g_evse_nmk, sizeof(g_evse_nmk));
    memcpy(g_saved_params.mac, g_src_mac, ETH_ALEN);
    memcpy(g_saved_params.pev_id, g_slac_ctx.pev_id, sizeof(g_saved_params.pev_id));
    memcpy(g_saved_params.evse_id, g_slac_ctx.evse_id, sizeof(g_saved_params.evse_id));
    qca7000LeaveAvln();
    if (g_pwr >= 0)
        gpio_set_level(static_cast<gpio_num_t>(g_pwr), 0);
    g_sleeping = true;
    if (g_link_ready_cb)
        g_link_ready_cb(false, g_link_ready_arg);
    return true;
}

bool qca7000Wake() {
    if (!g_sleeping)
        return true;
    if (g_pwr >= 0) {
        gpio_set_level(static_cast<gpio_num_t>(g_pwr), 1);
        slac_delay(QCA7000_POWER_CYCLE_DELAY_MS);
    }
    if (!hardReset())
        return false;
    qca7000SetMac(g_saved_params.mac);
    qca7000SetIds(g_saved_params.pev_id, g_saved_params.evse_id);
    qca7000SetNmk(g_saved_params.nmk);
    g_sleeping = false;
    if (g_link_ready_cb)
        g_link_ready_cb(true, g_link_ready_arg);
    return true;
}

#ifdef ESP_PLATFORM
#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>
#include <freertos/task.h>
#include <slac/channel.hpp>

void qca7000_task(void* arg) {
    auto* ctx = static_cast<Qca7000TaskContext*>(arg);
    slac::messages::HomeplugMessage msg;

    while (true) {
        qca7000Process();
        if (ctx && ctx->channel && ctx->channel->poll(msg)) {
            if (ctx->queue) {
                xQueueSend(ctx->queue, &msg, 0);
            }
        }
        vTaskDelay(pdMS_TO_TICKS(1));
    }
}
#endif
